Repository: levellearn/level-learn-api
Catalog: LevelLearn.Resource/Resources/SharedResource.*.resx
Languages: pt_br

# AlunoRAObrigatorio
source: RA needs to be filled
pt_br: RA precisa estar preenchido

# AtualizadoSucesso
source: Updated successfully
pt_br: Atualizado com sucesso

# CadastradoSucesso
source: Registered successfully
pt_br: Cadastrado com sucesso

# CPFJaExiste
source: CPF already exists
pt_br: CPF já existente

# DadosInvalidos
source: Invalid data
pt_br: Dados inválidos

# DeletadoSucesso
source: Deleted successfully
pt_br: Deletado com sucesso

# ErroInternoServidor
source: Oops, an error occurred in the system!
pt_br: Ops, ocorreu um erro no sistema!

# FalhaAtualizar
source: Failed to update
pt_br: Falha ao atualizar

# FalhaCadastrar
source: Failed to register
pt_br: Falha ao cadastrar

# FalhaDeletar
source: Failed to delete
pt_br: Falha ao deletar

# InstituicaoDescricaoObrigatorio
source: Description must be filled
pt_br: Descrição precisa estar preenchida

# InstituicaoDescricaoTamanho
source: Description can have a maximum of {0} characters
pt_br: Descrição pode ter no máximo {0} caracteres

# InstituicaoJaExiste
source: Institution already exists
pt_br: Instituição já existente

# InstituicaoNaoEncontrada
source: Institution does not exist
pt_br: Instituição não encontrada

# InstituicaoNaoPermitida
source: You are not the Administrator of this institution
pt_br: Você não é Administrador dessa instituição

# InstituicaoNomeObrigatorio
source: Name must be filled
pt_br: Nome precisa estar preenchido

# InstituicaoNomeTamanho
source: Name must be between {0} and {1} characters
pt_br: Nome precisa estar entre {0} e {1} caracteres

# NaoEncontrado
source: Register not found
pt_br: Registro não encontrado

# PessoaCelularInvalido
source: Cell is not valid
pt_br: Celular não é válido

# PessoaCPFInvalido
source: CPF is not valid
pt_br: CPF não é válido

# PessoaDataNascimentoInvalida
source: Birth Date must be less than today
pt_br: Data Nascimento precisa ser menor que hoje

# PessoaGeneroObrigatorio
source: Gender must be filled
pt_br: Gênero precisa ser informado

# PessoaImagemObrigatoria
source: Image must be filled
pt_br: Imagem precisa estar preenchida

# PessoaNickNameInvalido
source: NickName must only contain letters, numbers, dash (_), hyphen (-) and dot (.)
pt_br: NickName somente deve conter letras, números, traço(_), hífen(-) e ponto(.)

# PessoaNickNameObrigatorio
source: NickName must be filled
pt_br: NickName precisa estar preenchido

# PessoaNickNameTamanhoMaximo
source: NickName can be a maximum of {0} characters
pt_br: NickName pode ter no máximo {0} caracteres

# PessoaNomeObrigatorio
source: Name must be filled
pt_br: Nome precisa estar preenchido

# PessoaNomePrecisaSobrenome
source: First name needs a surname
pt_br: Nome precisa de um sobrenome

# PessoaNomeTamanho
source: Name must be between {0} and {1} characters
pt_br: Nome precisa estar entre {0} e {1} caracteres

# PessoaTipoPessoaInvalido
source: Type of person needs to be Admin, Teacher or Student
pt_br: Tipo de pessoa precisa ser Admin, Professor ou Aluno

# ProfessorCPFObrigatorio
source: CPF needs to be filled
pt_br: CPF precisa estar preenchido

# UsuarioConfirmacaoSenhaNaoConfere
source: Password and password confirmation do not match
pt_br: Senha e confirmação de senha não coincidem

# UsuarioConfirmacaoSenhaObrigatoria
source: Password confirmation must be completed
pt_br: Confirmação de senha precisa estar preenchida

# UsuarioContaBloqueada
source: Your account is blocked
pt_br: Sua conta está bloqueada

# UsuarioEmailConfirmarFalha
source: E-mail cannot be confirmed
pt_br: E-mail não pode ser confirmado

# UsuarioEmailConfirmarSucesso
source: E-mail successfully confirmed
pt_br: E-mail confirmado com sucesso

# UsuarioEmailInvalido
source: Email is not valid
pt_br: E-mail não é válido

# UsuarioEmailJaExiste
source: E-mail already exists
pt_br: E-mail já existente

# UsuarioEmailNaoConfirmado
source: E-mail is not confirmed
pt_br: E-mail não está confirmado

# UsuarioEmailTamanhoMaximo
source: E-mail can be a maximum of {0} characters
pt_br: E-mail pode ter no máximo {0} caracteres

# UsuarioLoginFalha
source: Invalid username and / or password
pt_br: Usuário e/ou senha inválidos

# UsuarioLoginSucesso
source: Login successfully
pt_br: Login feito com sucesso

# UsuarioLogoutSucesso
source: Logout successfully
pt_br: Logout feito com sucesso

# UsuarioSenhaObrigatoria
source: Password must be filled
pt_br: Senha precisa estar preenchida

# UsuarioSenhaRequerDigito
source: Password needs at least one digit
pt_br: Senha precisa no mínimo de um dígito

# UsuarioSenhaRequerEspecial
source: Password needs at least one special character
pt_br: Senha precisa no mínimo de um caractere especial

# UsuarioSenhaRequerMaiusculo
source: Password needs at least one uppercase letter
pt_br: Senha precisa no mínimo de uma letra maiúscula

# UsuarioSenhaRequerMinusculo
source: Password needs at least one lowercase letter
pt_br: Senha precisa no mínimo de uma letra minúscula

# UsuarioSenhaTamanho
source: Password must be between {0} and {1} characters
pt_br: Senha precisa estar entre {0} e {1} caracteres
